Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui == UI_COUNTDOWN && b == BTN_DOWN)
    {
        ModelHandle_StopCountdown();
        ui = UI_DASH;
        screenNeedsRefresh = true;
        return;
    }

    if (b == BTN_RESET)
    {
        if (ui == UI_DASH)
        {
            if (!ModelHandle_IsRestartActive())
                ModelHandle_StartRestart();
            else
                ModelHandle_StopRestart();
        }
        else
        {
            switch (ui)
            {
                case UI_SETTINGS_GAP:
                case UI_SETTINGS_RETRY:
                case UI_SETTINGS_UV:
                case UI_SETTINGS_OV:
                case UI_SETTINGS_OL:
                case UI_SETTINGS_UL:
                case UI_SETTINGS_MAXRUN:
                case UI_SETTINGS_PWRREST:
                case UI_SETTINGS_FACTORY:
                case UI_DEVSET_EDIT_DATE:
                case UI_DEVSET_EDIT_TIME:
                case UI_DEVSET_EDIT_DAY:
                    ui = UI_DEVSET_MENU;
                    break;
                case UI_DEVSET_MENU:
                case UI_ADD_DEVICE_MENU:
                case UI_ADD_DEVICE_PAIR:
                case UI_ADD_DEVICE_REMOVE:
                case UI_ADD_DEVICE_PAIR_DONE:
                case UI_ADD_DEVICE_REMOVE_DONE:
                    ui = UI_MENU;
                    break;
                case UI_COUNTDOWN_EDIT_MIN:
                    ui = UI_COUNTDOWN;
                    break;
                case UI_COUNTDOWN:
                    ModelHandle_StopCountdown();
                    ui = UI_DASH;
                    break;
                default:
                    ui = UI_DASH;
                    break;
            }
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_RESET_CONFIRM)
    {
        if (b == BTN_UP || b == BTN_DOWN)
            reset_confirm_yes = !reset_confirm_yes;
        else if (b == BTN_SELECT)
        {
            if (reset_confirm_yes) ModelHandle_FactoryReset();
            ui = UI_DASH;
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_DASH)
    {
        switch (b)
        {
            case BTN_RESET_LONG:
                ModelHandle_ToggleManual();
                break;
            case BTN_SELECT:
                if (!autoActive)
                    ModelHandle_StartAuto(edit_auto_gap_s, edit_auto_maxrun_min, edit_auto_retry);
                else
                    ModelHandle_StopAuto();
                break;
            case BTN_SELECT_LONG:
                ui = UI_MENU;
                menu_idx = 0;
                menu_view_top = 0;
                screenNeedsRefresh = true;
                return;
            case BTN_UP:
                if (!timerActive)
                    ModelHandle_Button3_SinglePress();
                else
                    ModelHandle_StopTimer();
                screenNeedsRefresh = true;
                break;
            case BTN_UP_LONG:
                if (!semiAutoActive)
                    ModelHandle_StartSemiAuto();
                else
                    ModelHandle_StopSemiAuto();
                screenNeedsRefresh = true;
                break;
            case BTN_DOWN:
                if (!countdownActive)
                {
                    ModelHandle_StartCountdown(edit_countdown_min * 60);
                    countdownActive = true;
                    ui = UI_COUNTDOWN;
                }
                else
                {
                    ModelHandle_StopCountdown();
                    countdownActive = false;
                    ui = UI_DASH;
                }
                screenNeedsRefresh = true;
                return;
            case BTN_DOWN_LONG:
                if (!countdownActive)
                {
                    ui = UI_COUNTDOWN_EDIT_MIN;
                    edit_countdown_min = 1;
                    screenNeedsRefresh = true;
                }
                break;
            default:
                break;
        }
        return;
    }

    if (ui == UI_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && menu_idx < MAIN_MENU_COUNT - 1) menu_idx++;
        else if (b == BTN_UP   && menu_idx > 0) menu_idx--;
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_DEVSET_MENU)
    {
        if (b == BTN_SELECT || b == BTN_SELECT_LONG) menu_select();
        else if (b == BTN_DOWN && devset_idx < DEVSET_MENU_COUNT - 1) devset_idx++;
        else if (b == BTN_UP   && devset_idx > 0) devset_idx--;
        screenNeedsRefresh = true;
        return;
    }

    if (ui != UI_DASH)
    {
        if      (b == BTN_UP)        increase_edit_value(1);
        else if (b == BTN_DOWN)      decrease_edit_value(1);
        else if (b == BTN_UP_LONG)   increase_edit_value(5);
        else if (b == BTN_DOWN_LONG) decrease_edit_value(5);
        else if (b == BTN_SELECT)    menu_select();
        screenNeedsRefresh = true;
        return;
    }
}

void Screen_Update(void)
{
    uint32_t now = HAL_GetTick();
    static uint32_t lastBlink = 0;

    if (ui >= UI_MAX_)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (now - lastBlink > CURSOR_BLINK_MS)
    {
        lastBlink = now;
        cursorVisible = !cursorVisible;
        if (ui == UI_MENU) screenNeedsRefresh = true;
    }

    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    if ((ui == UI_DASH || ui == UI_COUNTDOWN) &&
        (now - lastLcdUpdateTime) >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    if (screenNeedsRefresh || ui != last_ui)
    {
        if (ui != last_ui) { lcd_clear(); last_ui = ui; }
        screenNeedsRefresh = false;

        switch (ui)
        {
            case UI_WELCOME:           show_welcome();             break;
            case UI_DASH:              show_dash();                break;
            case UI_MENU:              show_menu();                break;
            case UI_COUNTDOWN:         show_countdown();           break;
            case UI_COUNTDOWN_EDIT_MIN:show_countdown_edit_min();  break;
            case UI_DEVSET_MENU:       show_devset_menu();         break;
            case UI_RESET_CONFIRM:     show_reset_confirm();       break;
            case UI_DEVSET_EDIT_DATE:  show_devset_edit_date();    break;
            case UI_DEVSET_EDIT_TIME:  show_devset_edit_time();    break;
            case UI_DEVSET_EDIT_DAY:   show_devset_edit_day();     break;
            /* Inline-toggle items don't navigate to a sub-screen,
               but leave these stubs for future navigation if needed */
            case UI_SETTINGS_GAP:      show_settings_gap();        break;
            case UI_SETTINGS_RETRY:    show_settings_retry();      break;
            case UI_SETTINGS_UV:       show_settings_uv();         break;
            case UI_SETTINGS_OV:       show_settings_ov();         break;
            case UI_SETTINGS_OL:       show_settings_ol();         break;
            case UI_SETTINGS_UL:       show_settings_ul();         break;
            case UI_SETTINGS_MAXRUN:   show_settings_maxrun();     break;
            case UI_SETTINGS_PWRREST:  show_settings_pwrrest();    break;
            case UI_SETTINGS_FACTORY:  show_settings_factory();    break;
            default: break;
        }
    }
}
